/*
	2018-10-22 14:02:47
	目的：复习return返回值类型 
*/

# include <stdio.h>

int f(int i)
{
	return 10;
}

int g(int i)
{
	return 10.05;			//		1. 
}

int main()
{
	int i = 99;
	float k = 99.9;			//		2. 
	
	printf("%d\n", i);
	printf("%f\n", k);

	i = f(5);
	printf("%d\n", i);
	
	k = g(5);
	printf("%f\n", k);		//		3. 
	
	return 0;
}

/*
	在dev中的输出结果是
-------------------------------- 
99
99.900002
10
10.000000

--------------------------------

	总结：
		1.因为函数的返回值是整型，所以最终 g 返回的不是 10.05 而是10 
		2.float 和 double 都不能保证可以把数据准确的储存的计算机中
		3. 因为 k 为浮点型数据，所以输出结果为 10.0000000 
*/ 
