/*
	2018-10-14 14:28:18
	目的：一次给多个变量键盘赋值 
*/ 

#include <stdio.h>

int main()
{
	int i,j,k;
	
	scanf("%d %d %d", &i, &j, &k);
	printf("i = %d, j = %d, k = %d\n", i, j, k);
	
	printf("请在输入一个数字后用逗号分隔开\n");
	scanf("%d,%d,%d", &i, &j, &k);
	printf("i = %d, j = %d, k = %d\n", i, j, k);
}

/*
	在Dev中的输出结果：
下图为第二次scanf时直接空格后接着输入，而不是先打逗号再输入 	 
-------------------------------- 
1 2 3
i = 1, j = 2, k = 3
4 5 7
i = 4, j = 2, k = 3
--------------------------------- 


下图为第二次scanf时先打逗号再输入
--------------------------------- 
1 2 3
i = 1, j = 2, k = 3
请在输入一个数字后用逗号分隔开
4,5,6
i = 4, j = 5, k = 6
--------------------------------- 
	总结：
		1.【非输入控制符必须原样输入（如英文符号只能是英文，不能是中文输入法的）】  
		2.使用scanf之前，最好先使用printf来提示用户用什么样的方式来输入
		3.scanf中尽量不要使用非输入控制符，尤其是\n 

*/
