/*

h
	2018-11-5 13:50:41
	目的：分苹果
			可分配次数 T <= 200
			原有苹果   N >= 1
			孩子	   M <= 10000
			可增苹果   K <= 10000
*/

#include <stdio.h>

int main() {
	int i,T,N,M,K;

	printf("请输入所需次数 ");
	scanf("%d", &T);

	if (T <= 200) {
		for (i=0; i<T; i++) {

			//读取数据			
			printf("请依次输入原有苹果N、孩子M、老师苹果K（空格隔开）:\n");
			scanf("%d%d%d", &N, &M, &K);

			//判断是否够分			
			if ( M <= (N+K) ) {
				printf("YES\n");
			} else {
				printf("NO\n");
			}
		}

	} else {
		printf("输入有误，请重新输入");

	}
	
	return 0; 

}

/*
	Output in Dev-C++
--------------------------------	 
请输入所需次数 2
请依次输入原有苹果N、孩子M、老师苹果K（空格隔开）:
10 3 4
YES
请依次输入原有苹果N、孩子M、老师苹果K（空格隔开）:
10 8 3
YES

--------------------------------
	Summary:
			1.	没能只输出一次结果
				即只要有一个不符合，便输出 NO	 
			2.	T 不符合后没能直接重新输出
				可考虑指定回到程序某一部分，或搞个函数出来判断 
*/

