/*
	2018-11-5 14:01:23
	目的：改进使得结果一次输出 
		  使用 goto 跳转 
*/

#include <stdio.h>

int main() {
	int i,T,N,M,K;
	int res = 1;

A:	printf("请输入所需次数 ");
	scanf("%d", &T);

	if (T <= 200) {
		for (i=0; i<T; i++) {

			//读取数据
			printf("请依次输入原有苹果N、孩子M、老师苹果K（空格隔开）:\n");
			scanf("%d%d%d", &N, &M, &K);

			//判断是否够分
			if ( M > (N+K) )
				res = -1;
		}

	} else {
		printf("输入有误，请重新输入\n");
		goto A; 
	}

	//输出结果 
	if (res == -1) {
		printf("NO");
	} else {
		printf("YES");
	}

	return 0;

}

/*
	Output in Dev-C++
-------------------------------- 
请输入所需次数 213
输入有误，请重新输入
请输入所需次数 3
请依次输入原有苹果N、孩子M、老师苹果K（空格隔开）:
10 8 3
请依次输入原有苹果N、孩子M、老师苹果K（空格隔开）:
10 8 5
请依次输入原有苹果N、孩子M、老师苹果K（空格隔开）:
10 16 2
NO
-------------------------------- 
	Sumarry：
			1. 用 goto 造成序流程凌乱、使用不当会造成死循环
			   程序是一条指令一条指令的执行，使用goto后回转到标签的后的第一句然后继续向下执行 
*/

