/*
	2018-10-15 18:07:49
	目的：求回文数 
*/ 

#include <stdio.h>

int main()
{
	int num;	//存放待判断的数字
	int sum = 0,m;
	printf("请输入您需要判断的数字：");
	scanf("%d", &num);
	m = num;
	while (m)
	{
		sum = sum * 10 + m%10;
		m /= 10;
	}
	
	if(sum == num)
	{
		printf("该数字是回文数");
	}
	else
	{
		printf("该数字不是回文数");
	}
	
	return 0;
}

/*
	在dev中的输出结果是
-------------------------------- 
请输入您需要判断的数字：123321
该数字是回文数
--------------------------------

	总结：
		1. 容易把 num 直接代入循环， 而没有另外赋值一个 m 
		2. 易忽略 sum * 10 
*/
